

import UIKit
let emojiAll:[String:String] = ["happy":"😀", "smile":"☺", "laughing":"😆", "crazy":"🤣","tear,":"😂", "crazylaugh":"😁", "upsidedown":"🙃","wink":"😉", "relieved":"😌", "loveeyes":"😍", "lovely":"🥰", "kiss":"😙", "kisswitheart":"😘", "overing":"😋", "tongue":"😛", "squnting":"😜", "winking":"🤪", "raised":"🤨", "monocle":"🧐", "cool":"😎", "nerd":"🤓", "starstruck":"🤩", "party":"🥳", "smirking":"😏", "unamused":"😒", "disappointed":"😞", "pensive":"😟", "worried":"😕", "confused":"😫", "tired":"😩", "weary":"👺", "pleading":"🥺", "cry":"😢", "loudcry":"😭", "angry":"😠", "pouting":"😡", "shoutangry":"🤬", "explode":"🤯", "flushed":"😳", "hot":"🥵", "cold":"🥶", "scream":"😱","fear":"😨", "sad":"😥", "think":"🤔", "shushing":"🤫", "lying":"🤥", "neutral":"😐", "rolleyes":"🙄", "hushed":"😯", "frowning":"😧", "anguished":"😲", "sleep":"😴", "drooling":"🤤", "snooze":"😪", "dizzy":"😵", "woozy":"🤮", "sick":"🤧", "hurt":"🤕", "money":"🤑", "cowboy":"🤠", "angryhorn":"👿", "happyhorn":"😈", "poobad":"💩", "ghost":"👻", "danger":"💀", "alert":"☠", "cat":"😺", "handrise":"🤲", "openhand":"👐", "raising":"🙌", "clap":"👏", "handshake":"🤝", "thumbsup":"👍", "thumbsdown":"👎", "rock":"🤟", "victory":"✌", "nice":"👌", "right":"👉", "left":"👈", "up":"👆", "down":"👇", "bye":"👋", "body":"💪", "write":"✍", "leg":"🦶", "policeman":"👮", "policewomen":"🧒", "boy":"👩", "girl":"👷‍♀️", "build":"🕵️‍♀️", "research":"👨‍⚕️", "doctor":"", "king":"🤴", "queen":"👸", "chef":"👩‍🍳", "teacher":"👨‍🎓", "angel":"👼", "vampire":"🧛‍♂️", "love":"💑", "cross":"🙅", "run":"🏃", "life":"👫", "family":"👩‍👩‍👧‍👦", "dress":"🧥", "shoes":"👞", "taj":"👑", "ring":"💍", "glass":"👓", "apple":"🍎", "orange":"🍊", "banana":"🍌", "coconut":"🥥", "rice":"🍙", "chocolate":"🍫", "popcorn":"🍿", "donut":"🍩", "noodles":"🍜", "beer":"🍺", "tea":"☕", "coffee":"☕", "wine":"🍷", "soup":"🥣", "soda":"🥤", "heart":"❤", "heartbreak":"💔", "revolve":"💖", "gift":"💝", "monkey":"🐵", "fox":"🦊", "cock":"🐔", "dog":"🐶", "snake":"🐍", "sun":"🌞", "star":"⭐", "moon":"🌕", "fire":"🔥", "cloud":"🌧", "rain":"☁", "snow":"❄", "snowman":"⛄", "pizza":"🍕", "burger":"🍔", "meat":"🥩"]

let Randomemoji = "😀😃😄😁😆😅🤣😂🙂🙃😉😊😇🥰😍🤩😘😗☺️😚😙😋😛😜🤪😝🤑🤗🤭🤫🤔🤐🤨😐😑😶😏😒🙄😬🤥😌😔😪🤤😴😷🤒🤕🤢🤮🤧🥵🥶🥴😵🤯🤠🥳😎🤓🧐😕😟🙁☹️😮😯😲😳🥺😦😧😨😰😥😢😭😱😖😣😞😓😩😫🥱😤😡😠🤬😈👿💀☠️💩🤡👹👺👻👽👾🤖😺😸😹😻😼😽🙀😿😾💋👋🤚🖐️✋🖖👌🤏✌️🤞🤟🤘🤙👈👉👆🖕👇☝️👍👎✊👊🤛🤜👏🙌👐🤲🤝🙏✍️💅🤳💪🦾🦿🦵🦶👂🦻👃🧠🦷🦴👀👁️👅👄👶🧒👦👧🧑👱👨🧔👨‍🦰👨‍🦱👨‍🦳👨‍🦲👩👩‍🦰🧑‍🦰👩‍🦱🧑‍🦱👩‍🦳🧑‍🦳👩‍🦲🧑‍🦲👱‍♀️👱‍♂️🧓👴👵🙍🙍‍♂️🙍‍♀️🙎🙎‍♂️🙎‍♀️🙅🙅‍♂️🙅‍♀️🙆🙆‍♂️🙆‍♀️💁💁‍♂️💁‍♀️🙋🙋‍♂️🙋‍♀️🧏🧏‍♂️🧏‍♀️🙇🙇‍♂️🙇‍♀️🤦🤦‍♂️🤦‍♀️🤷🤷‍♂️🤷‍♀️🧑‍⚕️👨‍⚕️👩‍⚕️🧑‍🎓👨‍🎓👩‍🎓🧑‍🏫👨‍🏫👩‍🏫🧑‍⚖️👨‍⚖️👩‍⚖️🧑‍🌾👨‍🌾👩‍🌾🧑‍🍳👨‍🍳👩‍🍳🧑‍🔧👨‍🔧👩‍🔧🧑‍🏭👨‍🏭👩‍🏭🧑‍💼👨‍💼👩‍💼🧑‍🔬👨‍🔬👩‍🔬🧑‍💻👨‍💻👩‍💻🧑‍🎤👨‍🎤👩‍🎤🧑‍🎨👨‍🎨👩‍🎨🧑‍✈️👨‍✈️👩‍✈️🧑‍🚀👨‍🚀👩‍🚀🧑‍🚒👨‍🚒👩‍🚒👮👮‍♂️👮‍♀️🕵️🕵️‍♂️🕵️‍♀️💂💂‍♂️💂‍♀️👷👷‍♂️👷‍♀️🤴👸👳👳‍♂️👳‍♀️👲🧕🤵👰🤰🤱👼🎅🤶🦸🦸‍♂️🦸‍♀️🦹🦹‍♂️🦹‍♀️🧙🧙‍♂️🧙‍♀️🧚🧚‍♂️🧚‍♀️🧛🧛‍♂️🧛‍♀️🧜🧜‍♂️🧜‍♀️🧝🧝‍♂️🧝‍♀️🧞🧞‍♂️🧞‍♀️🧟🧟‍♂️🧟‍♀️💆💆‍♂️💆‍♀️💇💇‍♂️💇‍♀️🚶🚶‍♂️🚶‍♀️🧍🧍‍♂️🧍‍♀️🧎🧎‍♂️🧎‍♀️🧑‍🦯👨‍🦯👩‍🦯🧑‍🦼👨‍🦼👩‍🦼🧑‍🦽👨‍🦽👩‍🦽🏃🏃‍♂️🏃‍♀️💃🕺🕴️👯👯‍♂️👯‍♀️🧖🧖‍♂️🧖‍♀️🧘🧑‍🤝‍🧑👭👫👬💏👩‍❤️‍💋‍👨👨‍❤️‍💋‍👨👩‍❤️‍💋‍👩💑👩‍❤️‍👨👨‍❤️‍👨👩‍❤️‍👩👪👨‍👩‍👦👨‍👩‍👧👨‍👩‍👧‍👦👨‍👩‍👦‍👦👨‍👩‍👧‍👧👨‍👨‍👦👨‍👨‍👧👨‍👨‍👧‍👦👨‍👨‍👦‍👦👨‍👨‍👧‍👧👩‍👩‍👦👩‍👩‍👧👩‍👩‍👧‍👦👩‍👩‍👦‍👦👩‍👩‍👧‍👧👨‍👦👨‍👦‍👦👨‍👧👨‍👧‍👦👨‍👧‍👧👩‍👦👩‍👦‍👦👩‍👧👩‍👧‍👦👩‍👧‍👧🗣️👤👥👣🧳🌂☂️🎃🧵🧶👓🕶️🥽🥼🦺👔👕👖🧣🧤🧥🧦👗👘🥻🩱🩲🩳👙👚👛👜👝🎒👞👟🥾🥿👠👡🩰👢👑👒🎩🎓🧢⛑️💄💍💼🩸"

let random_emojis = "🗣🥈🏅🎾🎳🏑🏓🎣🥋🎱📣🔔🎵📽📀🍇🍉🍓🍅🍌🥕🌽🥒🥡🥧🍼🍾🥢🥄🏺🦁🐑🐇🐪🐿🐾🐍🐡🕸🕷🦂"

                                                //MARK:- FONT STYLE -
let Allfonts = ["『F』『O』『N』『T』", "Ⓕ Ⓞ Ⓝ Ⓣ", "ｆ ｏ ｎ ｔ", "Ϝ ⊙ ♫ ☂", "F͎ O͎ N͎ T͎", "🅕 🅞 🅝 🅣", "🄵 🄾 🄽 🅃", "🅵 🅾 🅽 🆃", "♥F ♥O ♥N ♥T", "F ₒ ₙ ₜ", "₣ Ø ₦ ₮", "ʄ օ ռ ȶ", "ᖴ ᓍ ᘉ ᖶ", "f͜͡ o͜͡ n͜͡ t͜͡", "ғ 𝔬 Ň т", "𝓕 𝓞 𝓝 𝓣", "f͙͛ o͙͛ n͙͛ t͙͛", "Ƒ ට ហ Ͳ", "ғ 𝐎 ή 𝕋", "░F ░O ░N ░T", "Ｆ ♢ Ｎ Ｔ", "千 龱 𝓝 ㄒ", "ⓕ̣̣̣ ⓞ̣̣̣ ⓝ̣̣̣ ⓣ̣̣̣", "𝔽 𝕆 ℕ 𝕋", "☞ ⚐︎ ☠ ❄"]


let textStyle1 = ["『A』","『B』","『C』","『D』","『E』","『F』","『G』","『H』","『I』", "『J』", "『K』", "『L』", "『M』", "『N』", "『O』", "『P』", "『Q』", "『R』", "『S』", "『T』", "『U』", "『V』", "『W』", "『X』", "『Y』", "『Z』"]
let fontStyle2 = ["Ⓐ", "Ⓑ", "Ⓒ", "Ⓓ", "Ⓔ", "Ⓕ", "Ⓖ", "Ⓗ", "Ⓘ", "Ⓙ", "Ⓚ", "Ⓛ", "Ⓜ", "Ⓝ", "Ⓞ", "Ⓟ", "Ⓠ", "Ⓡ", "Ⓢ", "Ⓣ", "Ⓤ", "Ⓥ", "Ⓦ", "Ⓧ", "Ⓨ", "Ⓩ"]
let fontStyle3 = ["ａ", "ｂ", "ｃ", "ｄ", "ｅ", "ｆ", "ｇ", "ｈ", "ｉ", "ｊ", "ｋ", "ｌ", "ｍ", "ｎ", "ｏ", "ｐ", "ｑ", "ｒ", "ｓ", "ｔ", "ｕ", "ｖ", "ｗ", "ｘ", "ｙ", "ｚ"]
let fontStyle4 = ["ꍏ", "♭", "☾", "◗", "€", "Ϝ", "❡", "♄", "♗", "♪", "ϰ", "↳", "♔", "♫", "⊙", "ρ", "☭", "☈", "ⓢ", "☂", "☋", "✓", "ω", "⌘", "☿", "☡"]
let fontStyle5 = [" 🅰", "🅱", "🌜", "🌛", "🎗", "🎏", "🌀", "♓", "🎐", "🎷", "🎋", "👢", "〽️", "🎵", "⚽", "🅿", "️🍳", "🌱", "💲", "🌴", "⛎", "✅", "🔱", "❎", "🍸", "💤"]
let fontStyle6 = ["A͎", "B͎", "C͎", "D͎", "E͎", "F͎", "G͎", "H͎", "I͎", "J͎", "K͎", "L͎", "M͎", "N͎", "O͎", "P͎", "Q͎", "R͎", "S͎", "T͎", "U͎", "V͎", "W͎", "X͎", "Y͎", "Z͎"]
let fontStyle7 = ["🅐", "🅑", "🅒", "🅓", "🅔", "🅕", "🅖", "🅗", "🅘", "🅙", "🅚", "🅛", "🅜", "🅝", "🅞", "🅟", "🅠", "🅡", "🅢", "🅣", "🅤", "🅥", "🅠", "🅧", "🅨", "🅩"]
let fontStyle8 = ["🄰", "🄱", "🄲", "🄳", "🄴", "🄵", "🄶", "🄷", "🄸", "🄹", "🄺", "🄻", "🄼", "🄽", "🄾", "🄿", "🅀", "🅁", "🅂", "🅃", "🅄", "🅅", "🅀", "🅇", "🅈", "🅉"]
let fontStyle9 = ["🅰", "🅱", "🅲", "🅳", "🅴", "🅵", "🅶", "🅷", "🅸", "🅹", "🅺", "🅻", "🅼", "🅽", "🅾", "🅿", "🆀", "🆁", "🆂", "🆃", "🆄", "🆅", "🆀", "🆇", "🆈", "🆉"]
let fontStyle10 = ["A", "♥B", "♥C", "♥D", "♥E", "♥F", "♥G", "♥H", "♥I", "♥J", "♥K", "♥L", "♥M", "♥N", "♥O", "♥P", "♥Q", "♥R", "♥S", "♥T", "♥U", "♥V", "♥W", "♥X", "♥Y", "♥Z"]
let fontStyle11 = ["✌", "︎👌", "︎👍", "︎👎", "︎☜", "☞", "︎☝", "︎☟", "︎✋", "︎☺", "︎😐", "︎☹", "︎💣", "︎☠", "︎⚐︎", "🏱", "︎✈", "︎☼", "︎💧", "︎❄", "︎🕆", "︎✞", "︎🕈", "︎✠", "︎✡", "︎☪"]
let fontStyle12 = ["ₐ", "B", "C", "D", "ₑ", "F", "G", "ₕ", "ᵢ", "ⱼ", "ₖ", "ₗ", "ₘ", "ₙ", "ₒ", "ₚ", "Q", "ᵣ", "ₛ", "ₜ", "ᵤ", "ᵥ", "W", "ₓ", "Y", "Z"]
let fontStyle13 = ["₳", "฿", "₵", "Đ", "Ɇ", "₣", "₲", "Ⱨ", "ł", "J", "₭", "Ⱡ", "₥", "₦", "Ø", "₱", "Q", "Ɽ", "₴", "₮", "Ʉ", "V", "₩", "Ӿ", "Ɏ", "Ⱬ"]
let fontStyle14 = ["ǟ", "ɮ", "ƈ", "ɖ", "ɛ", "ʄ", "ɢ", "ɦ", "ɨ", "ʝ", "ӄ", "ʟ", "ʍ", "ռ", "օ", "ք", "զ", "ʀ", "ֆ", "ȶ", "ʊ", "ʋ", "ա", "Ӽ", "ʏ", "ʐ"]
let fontStyle15 = ["ᗩ", "ᗷ", "ᑢ", "ᕲ", "ᘿ", "ᖴ", "ᘜ", "ᕼ", "ᓰ", "ᒚ", "ᖽᐸ", "ᒪ", "ᘻ", "ᘉ", "ᓍ", "ᕵ", "ᕴ", "ᖇ", "S", "ᖶ", "ᑘ", "ᐺ", "ᘺ", "᙭", "ᖻ", "ᗱ"]
let fontStyle16 = ["卂", "в", "¢", "𝒹", "Ẹ", "ғ", "ᵍ", "𝕙", "เ", "Ⓙ", "𝕂", "𝓛", "𝓂", "Ň", "𝔬", "ｐ", "q", "Ř", "𝐬", "т", "𝐔", "ᐯ", "ω", "𝓧", "ץ", "Ƶ"]
let fontStyle17 = ["a͜͡", "b͜͡", "c͜͡", "d͜͡", "e͜͡", "f͜͡", "g͜͡", "h͜͡", "i͜͡", "j͜͡", "k͜͡", "l͜͡", "m͜͡", "n͜͡", "o͜͡", "p͜͡", "q͜͡", "r͜͡", "s͜͡", "t͜͡", "u͜͡", "v͜͡", "w͜͡", "x͜͡", "y͜͡", "z͜͡"]
let fontStyle18 = ["𝓐", "𝓑", "𝓒", "𝓓", "𝓔", "𝓕", "𝓖", "𝓗", "𝓘", "𝓙", "𝓚", "𝓛", "𝓜", "𝓝", "𝓞", "𝓟", "𝓠", "𝓡", "𝓢", "𝓣", "𝓤", "𝓥", "𝓦", "𝓧", "𝓨", "𝓩"]
let fontStyle19 = ["a͙͛", "b͙͛", "c͙͛", "d͙͛", "e͙͛", "f͙͛", "g͙͛", "h͙͛", "i͙͛", "j͙͛", "k͙͛", "l͙͛", "m͙͛", "n͙͛", "o͙͛", "p͙͛", "q͙͛", "r͙͛", "s͙͛", "t͙͛", "u͙͛", "v͙͛", "w͙͛", "x͙͛", "y͙͛", "z͙͛"]
let fontStyle20 = ["Ⱥ", "β", "↻", "Ꭰ", "Ɛ", "Ƒ", "Ɠ", "Ƕ", "į", "ل", "Ҡ", "Ꝉ", "Ɱ", "ហ", "ට", "φ", "Ҩ", "འ", "Ϛ", "Ͳ", "Ա", "Ỽ", "చ", "ჯ", "Ӌ", "ɀ"]
let fontStyle21 = ["Δ", "ᵇ", "Ⓒ", "Ď", "Ⓔ", "ғ", "𝓰", "Ⓗ", "𝕀", "𝕛", "ｋ", "𝓁", "𝕞", "ή", "𝐎", "ק", "𝓆", "𝓻", "Ŝ", "𝕋", "Ⓤ", "𝔳", "𝔴", "Ж", "ⓨ", "ž"]
let fontStyle22 = ["░A", "░B", "░C", "░D", "░E", "░F", "░G", "░H", "░I", "░J", "░K", "░L", "░M", "░N", "░O", "░P", "░Q", "░R", "░S", "░T", "░U", "░V", "░W", "░X", "░Y", "░Z"]
let fontStyle23 = ["Λ", "Ｂ", "Ｃ", "Ｄ", "Σ", "Ｆ", "Ｇ", "Ｈ", "Ｉ", "Ｊ", "Ｋ", "Ｌ", "Ｍ", "Ｎ", "♢", "Ｐ", "Ｑ", "Ｒ", "Ｓ", "Ｔ", "Ｕ", "Ｖ", "Ｗ", "Ｘ", "Ｙ", "Ｚ"]
let fontStyle24 = ["闩", "乃", "⼕", "ᗪ", "㠪", "千", "Ꮆ", "廾", "工", "丿", "长", "㇄", "爪", "𝓝", "龱", "尸", "Ɋ", "尺", "丂", "ㄒ", "ㄩ", "ᐯ", "山", "乂", "ㄚ", "乙"]
let fontStyle25 = ["ⓐ̣̣̣", "ⓑ̣̣̣", "ⓒ̣̣̣", "ⓓ̣̣̣", "ⓔ̣̣̣", "ⓕ̣̣̣", "ⓖ̣̣̣", "ⓗ̣̣̣", "ⓘ̣̣̣", "ⓙ̣̣̣", "ⓚ̣̣̣", "ⓛ̣̣̣", "ⓜ̣̣̣", "ⓝ̣̣̣", "ⓞ̣̣̣", "ⓟ̣̣̣", "ⓠ̣̣̣", "ⓡ̣̣̣", "ⓢ̣̣̣", "ⓣ̣̣̣", "ⓤ̣̣̣", "ⓥ̣̣̣", "ⓦ̣̣̣", "ⓧ̣̣̣", "ⓨ̣̣̣", "ⓩ̣̣̣ "]
let fontStyle26 = ["𝔸", "𝔹", "ℂ", "𝔻", "𝔼", "𝔽", "𝔾", "ℍ", "𝕀", "𝕁", "𝕂", "𝕃", "𝕄", "ℕ", "𝕆", "ℙ", "ℚ", "ℝ", "𝕊", "𝕋", "𝕌", "𝕍", "𝕎", "𝕏", "𝕐", "ℤ"]

